# Chapter 6

## 6.1 Reading and Writing Data in Text Format

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.csv")

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
df_without_headers = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.csv", header=None)

In [5]:
df_without_headers

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [6]:
df_with_names = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.csv", names=["a", "b", "c", "d", "message"])

In [7]:
df_with_names

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [8]:
names = ["a", "b", "c", "d", "message"]

In [9]:
df_names_index_col = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.csv", names=names, index_col="message")

In [10]:
df_names_index_col

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
parsed = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\csv_mindex.csv", index_col=["key1", "key2"])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
result = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex3.txt", sep="\s+")

In [14]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
result = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv")

In [17]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [19]:
result = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv", na_values=["NULL"])

In [20]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
result2 = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv", keep_default_na=False)

In [22]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [23]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [24]:
result3 = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv", keep_default_na=False, na_values=["NA"])

In [25]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [26]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [27]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [28]:
pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv", na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Reading Text Files in Pieces

In [29]:
pd.options.display.max_rows = 10

In [30]:
result = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex6.csv")

In [31]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [32]:
pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [33]:
chunker = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex6.csv", chunksize=1000)

In [34]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [35]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

In [36]:
tot = tot.sort_values(ascending=False)

In [37]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [38]:
data = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex5.csv")

In [39]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
data.to_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\out.csv")

In [41]:
import sys

In [42]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Working with Other Delimited Formats

In [46]:
import csv

In [47]:
f = open(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex7.csv")

In [48]:
reader = csv.reader(f)

In [49]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [50]:
f.close()

In [51]:
with open(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex7.csv") as f:
    lines = list(csv.reader(f))

In [52]:
header, values = lines[0], lines[1:]

In [53]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [54]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [55]:
f = open(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex7.csv")

In [56]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [57]:
reader = csv.reader(f, dialect=my_dialect)

In [58]:
reader = csv.reader(f, delimiter="|")

In [59]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [60]:
f.close()

### JSON Data

In [61]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["driving", "art"]}]
}
"""

In [62]:
import json

In [63]:
result = json.loads(obj)

In [64]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['driving', 'art']}]}

In [65]:
asjson = json.dumps(result)

In [66]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["driving", "art"]}]}'

In [67]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [68]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [69]:
data = pd.read_json(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\example.json")

In [70]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [71]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [72]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [73]:
conda install lxml beautifulsoup4 html5lib

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 4.12.0
  latest version: 23.9.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [74]:
tables = pd.read_html(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\fdic_failed_bank_list.html")

In [75]:
len(tables)

1

In [76]:
failures = tables[0]

In [77]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [78]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [79]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### Parsing XML with lxml.objectify

In [80]:
from lxml import objectify

In [81]:
path = r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\datasets\mta_perf\Performance_MNR.xml"

In [82]:
with open(path) as f:
    parsed = objectify.parse(f)

In [83]:
root = parsed.getroot()

In [84]:
data = []

In [85]:
skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ", "DESIRED_CHANGE", "DECIMAL_PLACES"]

In [86]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [87]:
perf = pd.DataFrame(data)

In [88]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [89]:
perf2 = pd.read_xml(path)

In [90]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

## 6.2 Binary Data Formats

In [91]:
frame = pd.read_csv(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.csv")

In [92]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [93]:
frame.to_pickle(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\frame_pickle")

In [94]:
pd.read_pickle(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [95]:
conda install pyarrow

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 4.12.0
  latest version: 23.9.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [96]:
fec = pd.read_parquet(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\datasets\fec.parquet")

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\seanb\\Desktop\\Pyhon_for_Data_Analysis\\Ch6\\datasets\\fec.parquet'

### Reading Microsoft Excel Files

In [97]:
xlsx = pd.ExcelFile(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.xlsx")

In [98]:
xlsx.sheet_names

['Sheet1']

In [99]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [100]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [102]:
frame = pd.read_excel(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex1.xlsx", sheet_name="Sheet1")

In [103]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [104]:
writer = pd.ExcelWriter(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\ex2.xlsx")

In [105]:
frame.to_excel(writer, "Sheet1")

In [106]:
writer.save()

## Using HDF5 Format

In [107]:
pip install tables

Requirement already satisfied: tables in c:\users\seanb\anaconda3\lib\site-packages (3.6.1)
Requirement already satisfied: numpy>=1.9.3 in c:\users\seanb\anaconda3\lib\site-packages (from tables) (1.20.3)
Requirement already satisfied: numexpr>=2.6.2 in c:\users\seanb\anaconda3\lib\site-packages (from tables) (2.7.3)
Note: you may need to restart the kernel to use updated packages.

In [108]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [109]:
sotre = pd.HDFStore(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\mydata.h5")

In [110]:
sotre["obj1"] = frame

In [111]:
sotre["obj1_col"] = frame["a"]

In [112]:
sotre

<class 'pandas.io.pytables.HDFStore'>
File path: C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\mydata.h5

In [113]:
sotre["obj1"]

           a
0   0.269197
1  -1.589750
2  -0.261832
3   1.966686
4  -1.029724
..       ...
95 -0.915768
96 -1.312544
97 -1.332598
98 -1.660270
99  0.556753

[100 rows x 1 columns]

In [114]:
sotre.put("obj2", frame, format="table")

In [115]:
sotre.select("obj2", where=["index >= 10 and index <= 15"])

           a
10 -0.065898
11  1.469465
12  0.006990
13 -0.606145
14  0.669152
15 -0.172936

In [116]:
sotre.close()

In [117]:
frame.to_hdf(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\mydata.h5", "obj3", format="table")

In [118]:
pd.read_hdf(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\mydata.h5", "obj3", where=["index < 5"])

          a
0  0.269197
1 -1.589750
2 -0.261832
3  1.966686
4 -1.029724

In [119]:
import os

In [120]:
os.remove(r"C:\Users\seanb\Desktop\Pyhon_for_Data_Analysis\Ch6\examples\mydata.h5")

## 6.3 Interacting with Web APIs

In [121]:
import requests

In [122]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [123]:
resp = requests.get(url)

In [124]:
resp.raise_for_status()

In [125]:
resp

In [126]:
data = resp.json()

In [127]:
data[0]["title"]

'BUG: manipulating or adding columns under a MultiIndex header yields no changes in the DataFrame whatsover. '

In [128]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [129]:
issues

,number,title,labels,state
0,55769,BUG: manipulating or adding columns under a Mu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,55768,BUG: OutOfBoundsDatetime with non-nano dt64tz ...,[],open
2,55767,PERF: Surprisingly slow nlargest with duplicat...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
3,55765,BUG: describe started rounding reported percen...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,55764,Revert logic for _constructor selection in _co...,[],open
...,...,...,...,...
25,55730,BUG: assert_frame_equal fails with AttributeEr...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,55728,BUG: incorrect handling of line breaks in OdsW...,[],open
27,55726,fix segfault with tz_localize_to_utc,"[{'id': 60458168, 'node_id': 'MDU6TGFiZWw2MDQ1...",open
28,55725,ENH: Add support to read and write Amazon ION ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,55721,BUG: `pd.read_parquet()` loads missing string ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## 6.4 Interacting with Databases

In [131]:
import sqlite3

In [132]:
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
     c REAL, d INTEGER);"""

In [133]:
con = sqlite3.connect("mydata.sqlite")

In [134]:
con.execute(query)

In [135]:
con.commit()

In [136]:
data = [("Atlanta", "Georgia", 1.25, 6),
       ("Tallahassee", "Florida", 2.6, 3),
       ("Sacramento", "California", 1.7, 5)]

In [137]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [139]:
con.executemany(stmt, data)

In [140]:
con.commit()

In [141]:
cursor = con.execute("SELECT * FROM test")

In [142]:
rows = cursor.fetchall()

In [143]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [144]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [145]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [146]:
import sqlalchemy as sqla

In [147]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [148]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5